Диплом/src/Documents/ДоговорыСКонтрагентами/ДоговорыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорыСКонтрагентами</name>
  <attributes>
    <name>РабочееНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПоставщик</name>
    <type>
      <types>CatalogRef.Организация</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПокупатель</name>
    <type>
      <types>CatalogRef.Организация</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусДляДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоставщика</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПокупателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
</mdclass:Document>

Диплом/src/Documents/ДоговорыСКонтрагентами/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорыСКонтрагентами.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыСКонтрагентами.БанковскийСчетПокупателя,
	|	ДоговорыСКонтрагентами.БанковскийСчетПоставщика,
	|	ДоговорыСКонтрагентами.Дата,
	|	ДоговорыСКонтрагентами.ДатаЗаключения,
	|	ДоговорыСКонтрагентами.Комментарий,
	|	ДоговорыСКонтрагентами.КонтрагентПокупатель,
	|	ДоговорыСКонтрагентами.КонтрагентПоставщик,
	|	ДоговорыСКонтрагентами.Номер,
	|	ДоговорыСКонтрагентами.РабочееНаименование,
	|	ДоговорыСКонтрагентами.Статус,
	|	ДоговорыСКонтрагентами.Тип
	|ИЗ
	|	Документ.ДоговорыСКонтрагентами КАК ДоговорыСКонтрагентами
	|ГДЕ
	|	ДоговорыСКонтрагентами.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
